###############################################################################
# Created by write_sdc
# Tue May 20 20:08:22 2025
###############################################################################
current_design ZeroToFiveCounter
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 10.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rst}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {AN[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {AN[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {AN[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {AN[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {AN[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {AN[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {AN[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {AN[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {count[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {count[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {count[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {count[3]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {AN[7]}]
set_load -pin_load 0.0334 [get_ports {AN[6]}]
set_load -pin_load 0.0334 [get_ports {AN[5]}]
set_load -pin_load 0.0334 [get_ports {AN[4]}]
set_load -pin_load 0.0334 [get_ports {AN[3]}]
set_load -pin_load 0.0334 [get_ports {AN[2]}]
set_load -pin_load 0.0334 [get_ports {AN[1]}]
set_load -pin_load 0.0334 [get_ports {AN[0]}]
set_load -pin_load 0.0334 [get_ports {count[3]}]
set_load -pin_load 0.0334 [get_ports {count[2]}]
set_load -pin_load 0.0334 [get_ports {count[1]}]
set_load -pin_load 0.0334 [get_ports {count[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_fanout 10.0000 [current_design]
