
===========================================================================
report_tns
============================================================================
tns -10.20

===========================================================================
report_wns
============================================================================
wns -2.97

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -2.97

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 4.13
