
===========================================================================
report_tns
============================================================================
tns -8.06

===========================================================================
report_wns
============================================================================
wns -2.47

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -2.47

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 4.11
